let DATA = [
  {
    name: "ユナイテッド・シネマ 前橋",
    movies: [
      {
        name: "アバター　ウェイ・オブ・ウォーター",
        schedules: [
          {
            type: "字幕",
            date: [
              "1672747500",
              "1672788600",
              "1672833900",
              "1672883400",
              "1672920300",
            ],
          },
          { type: "吹替", date: ["1672733700", "1672820100", "1672906500"] },
          { type: "3D/字幕", date: ["1672724700", "1672811100", "1672897500"] },
          {
            type: "4D/3D/吹替",
            date: [
              "1672720200",
              "1672745700",
              "1672792200",
              "1672806600",
              "1672832100",
              "1672878600",
              "1672893000",
              "1672918500",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/87901/photo/963b46b89d870b8b/320.jpg?1669336778",
        time: "192分",
      },
      {
        name: "THE FIRST SLAM DUNK",
        schedules: [
          {
            type: "",
            date: [
              "1672723800",
              "1672737300",
              "1672742100",
              "1672747500",
              "1672751700",
              "1672790400",
              "1672800300",
              "1672810200",
              "1672823700",
              "1672828500",
              "1672833900",
              "1672838100",
              "1672876800",
              "1672886700",
              "1672896600",
              "1672910100",
              "1672914900",
              "1672920300",
              "1672924500",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/94436/photo/7befffaa3f3651e6/320.jpg?1657190841",
        time: "124分",
      },
      {
        name: "Dr.コトー診療所",
        schedules: [
          {
            type: "",
            date: [
              "1672726800",
              "1672748400",
              "1672791300",
              "1672802700",
              "1672813200",
              "1672834800",
              "1672877700",
              "1672889100",
              "1672899600",
              "1672921200",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/97454/photo/733ed97069933f58/320.jpg?1666668520",
        time: "134分",
      },
      {
        name: "すずめの戸締まり",
        schedules: [
          {
            type: "",
            date: [
              "1672722900",
              "1672732800",
              "1672749300",
              "1672788600",
              "1672798800",
              "1672809300",
              "1672819200",
              "1672835700",
              "1672875000",
              "1672885200",
              "1672895700",
              "1672905600",
              "1672922100",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96308/photo/f8ec994b1f4038eb/320.jpg?1664411321",
        time: "121分",
      },
      {
        name: "ブラックナイトパレード",
        schedules: [
          {
            type: "",
            date: [
              "1672722900",
              "1672740000",
              "1672751100",
              "1672800300",
              "1672809300",
              "1672826400",
              "1672837500",
              "1672886700",
              "1672895700",
              "1672912800",
              "1672923900",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/97646/photo/34aa8440f0dc2317/320.jpg?1668039393",
        time: "108分",
      },
      {
        name: "ラーゲリより愛を込めて",
        schedules: [
          {
            type: "",
            date: [
              "1672720200",
              "1672730700",
              "1672795800",
              "1672806600",
              "1672817100",
              "1672882200",
              "1672893000",
              "1672903500",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/95937/photo/05aaa9e47445dd3a/320.jpg?1664841846",
        time: "133分",
      },
      {
        name: "かがみの孤城",
        schedules: [
          {
            type: "",
            date: [
              "1672721400",
              "1672740000",
              "1672750200",
              "1672789500",
              "1672807800",
              "1672826400",
              "1672836600",
              "1672875900",
              "1672894200",
              "1672912800",
              "1672923000",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96695/photo/1d10786283e8bfcf/320.jpg?1667811266",
        time: "116分",
      },
      {
        name: "月の満ち欠け",
        schedules: [
          { type: "", date: ["1672741200", "1672827600", "1672914000"] },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96678/photo/aafad3e34aaa1599/320.jpg?1663811052",
        time: "128分",
      },
      {
        name: "ONE PIECE FILM RED",
        schedules: [
          {
            type: "",
            date: ["1672792200", "1672801800", "1672878600", "1672888200"],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96171/photo/468bacb0534b07b2/320.jpg?1655175426",
        time: "115分",
      },
      {
        name: "劇場版　転生したらスライムだった件　紅蓮の絆編",
        schedules: [
          { type: "", date: ["1672730700", "1672817100", "1672903500"] },
        ],
        image:
          "https://eiga.k-img.com/images/movie/95737/photo/f44033f086bee050/320.jpg?1665104053",
        time: "108分",
      },
      {
        name: "かぐや様は告らせたい　ファーストキッスは終わらない",
        schedules: [
          {
            type: "",
            date: [
              "1672733700",
              "1672743000",
              "1672802700",
              "1672820100",
              "1672829400",
              "1672875000",
              "1672906500",
              "1672915800",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/97520/photo/b79a27695f80830b/320.jpg?1668995820",
        time: "90分",
      },
      {
        name: "ブラックアダム",
        schedules: [
          { type: "吹替", date: ["1672751100", "1672837500", "1672923900"] },
        ],
        image:
          "https://eiga.k-img.com/images/movie/92528/photo/30e4f67aecd9df55/320.jpg?1666141220",
        time: "124分",
      },
      {
        name: "仮面ライダーギーツ×リバイス MOVIE バトルロワイヤル",
        schedules: [
          {
            type: "",
            date: [
              "1672724700",
              "1672731900",
              "1672791300",
              "1672798800",
              "1672811100",
              "1672818300",
              "1672877700",
              "1672885200",
              "1672897500",
              "1672904700",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96582/photo/100fa180737e2613/320.jpg?1667104485",
        time: "95分",
      },
      {
        name: "トップガン　マーヴェリック",
        schedules: [
          { type: "4D/字幕", date: ["1672734900", "1672821300", "1672907700"] },
        ],
        image:
          "https://eiga.k-img.com/images/movie/91554/photo/d122f72f05591782/320.jpg?1576714760",
        time: "131分",
      },
      {
        name: "映画かいけつゾロリ　ラララ♪スターたんじょう",
        schedules: [{ type: "", date: ["1672789500", "1672875900"] }],
        image:
          "https://eiga.k-img.com/images/movie/97054/photo/2299b96285c8119e/320.jpg?1666051548",
        time: "70分",
      },
      {
        name: "劇場版　ソードアート・オンライン　プログレッシブ　冥（くら）き夕闇のスケルツォ",
        schedules: [
          { type: "", date: ["1672738800", "1672825200", "1672911600"] },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96043/photo/9370a00674c2ac89/320.jpg?1656739449",
        time: "100分",
      },
    ],
  },
  {
    name: "109シネマズ高崎",
    movies: [
      {
        name: "アバター　ウェイ・オブ・ウォーター",
        schedules: [
          { type: "字幕", date: ["1672726200", "1672812600", "1672899000"] },
          {
            type: "3D/吹替",
            date: [
              "1672744800",
              "1672792500",
              "1672806300",
              "1672831200",
              "1672878900",
              "1672892700",
              "1672917600",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/87901/photo/963b46b89d870b8b/320.jpg?1669336778",
        time: "192分",
      },
      {
        name: "THE FIRST SLAM DUNK",
        schedules: [
          {
            type: "",
            date: [
              "1672726800",
              "1672736400",
              "1672746300",
              "1672793100",
              "1672803600",
              "1672813200",
              "1672822800",
              "1672832700",
              "1672879500",
              "1672890000",
              "1672899600",
              "1672909200",
              "1672919100",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/94436/photo/7befffaa3f3651e6/320.jpg?1657190841",
        time: "124分",
      },
      {
        name: "Dr.コトー診療所",
        schedules: [
          {
            type: "",
            date: [
              "1672727100",
              "1672737300",
              "1672747500",
              "1672792800",
              "1672803300",
              "1672813500",
              "1672823700",
              "1672833900",
              "1672879200",
              "1672889700",
              "1672899900",
              "1672910100",
              "1672920300",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/97454/photo/733ed97069933f58/320.jpg?1666668520",
        time: "134分",
      },
      {
        name: "すずめの戸締まり",
        schedules: [
          {
            type: "",
            date: [
              "1672724400",
              "1672734900",
              "1672745100",
              "1672791600",
              "1672801200",
              "1672810800",
              "1672821300",
              "1672831500",
              "1672878000",
              "1672887600",
              "1672897200",
              "1672907700",
              "1672917900",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96308/photo/f8ec994b1f4038eb/320.jpg?1664411321",
        time: "121分",
      },
      {
        name: "ブラックナイトパレード",
        schedules: [
          {
            type: "",
            date: [
              "1672722900",
              "1672731600",
              "1672749300",
              "1672791900",
              "1672800600",
              "1672809300",
              "1672818000",
              "1672835700",
              "1672878300",
              "1672887000",
              "1672895700",
              "1672904400",
              "1672922100",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/97646/photo/34aa8440f0dc2317/320.jpg?1668039393",
        time: "108分",
      },
      {
        name: "ラーゲリより愛を込めて",
        schedules: [
          {
            type: "",
            date: [
              "1672734000",
              "1672748100",
              "1672791900",
              "1672802400",
              "1672820400",
              "1672834500",
              "1672878300",
              "1672888800",
              "1672906800",
              "1672920900",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/95937/photo/05aaa9e47445dd3a/320.jpg?1664841846",
        time: "133分",
      },
      {
        name: "月の満ち欠け",
        schedules: [
          {
            type: "",
            date: [
              "1672728000",
              "1672749000",
              "1672814400",
              "1672835400",
              "1672900800",
              "1672921800",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96678/photo/aafad3e34aaa1599/320.jpg?1663811052",
        time: "128分",
      },
      {
        name: "ONE PIECE FILM RED",
        schedules: [
          {
            type: "",
            date: [
              "1672730400",
              "1672747800",
              "1672816800",
              "1672834200",
              "1672903200",
              "1672920600",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96171/photo/468bacb0534b07b2/320.jpg?1655175426",
        time: "115分",
      },
      {
        name: "劇場版　転生したらスライムだった件　紅蓮の絆編",
        schedules: [
          {
            type: "",
            date: [
              "1672740000",
              "1672800300",
              "1672826400",
              "1672886700",
              "1672912800",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/95737/photo/f44033f086bee050/320.jpg?1665104053",
        time: "108分",
      },
      {
        name: "母性",
        schedules: [
          { type: "", date: ["1672740300", "1672826700", "1672913100"] },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96079/photo/24f6f72bdf57d06f/320.jpg?1659658931",
        time: "115分",
      },
      {
        name: "ブラックアダム",
        schedules: [
          { type: "吹替", date: ["1672738500", "1672824900", "1672911300"] },
        ],
        image:
          "https://eiga.k-img.com/images/movie/92528/photo/30e4f67aecd9df55/320.jpg?1666141220",
        time: "124分",
      },
      {
        name: "仮面ライダーギーツ×リバイス MOVIE バトルロワイヤル",
        schedules: [
          {
            type: "",
            date: [
              "1672722600",
              "1672739400",
              "1672792200",
              "1672799100",
              "1672809000",
              "1672825800",
              "1672878600",
              "1672885500",
              "1672895400",
              "1672912200",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96582/photo/100fa180737e2613/320.jpg?1667104485",
        time: "95分",
      },
      {
        name: "中島みゆき　劇場版　ライヴ・ヒストリー2",
        schedules: [
          {
            type: "",
            date: [
              "1672720500",
              "1672791600",
              "1672806900",
              "1672878000",
              "1672893300",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/98045/photo/4bbd70fedfac864d/320.jpg?1664342405",
        time: "90分",
      },
    ],
  },
  {
    name: "イオンシネマ高崎",
    movies: [
      {
        name: "アバター　ウェイ・オブ・ウォーター",
        schedules: [
          {
            type: "字幕",
            date: [
              "1672735800",
              "1672799100",
              "1672822200",
              "1672885500",
              "1672908600",
            ],
          },
          {
            type: "3D/吹替",
            date: [
              "1672731000",
              "1672744800",
              "1672790400",
              "1672803900",
              "1672817400",
              "1672831200",
              "1672876800",
              "1672890300",
              "1672903800",
              "1672917600",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/87901/photo/963b46b89d870b8b/320.jpg?1669336778",
        time: "192分",
      },
      {
        name: "THE FIRST SLAM DUNK",
        schedules: [
          {
            type: "",
            date: [
              "1672728300",
              "1672737600",
              "1672746900",
              "1672789500",
              "1672796100",
              "1672805400",
              "1672814700",
              "1672824000",
              "1672833300",
              "1672875900",
              "1672882500",
              "1672891800",
              "1672901100",
              "1672910400",
              "1672919700",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/94436/photo/7befffaa3f3651e6/320.jpg?1657190841",
        time: "124分",
      },
      {
        name: "Dr.コトー診療所",
        schedules: [
          {
            type: "",
            date: [
              "1672727100",
              "1672737300",
              "1672747500",
              "1672795200",
              "1672803300",
              "1672805400",
              "1672813500",
              "1672823700",
              "1672833900",
              "1672881600",
              "1672889700",
              "1672891800",
              "1672899900",
              "1672910100",
              "1672920300",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/97454/photo/733ed97069933f58/320.jpg?1666668520",
        time: "134分",
      },
      {
        name: "すずめの戸締まり",
        schedules: [
          {
            type: "",
            date: [
              "1672721400",
              "1672726200",
              "1672729200",
              "1672738800",
              "1672746000",
              "1672788600",
              "1672798200",
              "1672807800",
              "1672812600",
              "1672815600",
              "1672825200",
              "1672832400",
              "1672875000",
              "1672884600",
              "1672894200",
              "1672899000",
              "1672902000",
              "1672911600",
              "1672918800",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96308/photo/f8ec994b1f4038eb/320.jpg?1664411321",
        time: "121分",
      },
      {
        name: "ブラックナイトパレード",
        schedules: [
          {
            type: "",
            date: [
              "1672733400",
              "1672788900",
              "1672797600",
              "1672806300",
              "1672819800",
              "1672875300",
              "1672884000",
              "1672892700",
              "1672906200",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/97646/photo/34aa8440f0dc2317/320.jpg?1668039393",
        time: "108分",
      },
      {
        name: "ラーゲリより愛を込めて",
        schedules: [
          {
            type: "",
            date: [
              "1672723200",
              "1672746900",
              "1672789200",
              "1672799400",
              "1672809600",
              "1672833300",
              "1672875600",
              "1672885800",
              "1672896000",
              "1672919700",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/95937/photo/05aaa9e47445dd3a/320.jpg?1664841846",
        time: "133分",
      },
      {
        name: "かがみの孤城",
        schedules: [
          {
            type: "",
            date: [
              "1672720800",
              "1672738200",
              "1672747200",
              "1672789200",
              "1672807200",
              "1672824600",
              "1672833600",
              "1672875600",
              "1672893600",
              "1672911000",
              "1672920000",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96695/photo/1d10786283e8bfcf/320.jpg?1667811266",
        time: "116分",
      },
      {
        name: "月の満ち欠け",
        schedules: [
          { type: "", date: ["1672726500", "1672812900", "1672899300"] },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96678/photo/aafad3e34aaa1599/320.jpg?1663811052",
        time: "128分",
      },
      {
        name: "ホイットニー・ヒューストン I WANNA DANCE WITH SOMEBODY",
        schedules: [
          {
            type: "字幕",
            date: [
              "1672736100",
              "1672747200",
              "1672788000",
              "1672822500",
              "1672833600",
              "1672874400",
              "1672908900",
              "1672920000",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/97681/photo/d12c63bb6243e457/320.jpg?1671151359",
        time: "144分",
      },
      {
        name: "ONE PIECE FILM RED",
        schedules: [
          {
            type: "",
            date: [
              "1672728600",
              "1672737900",
              "1672815000",
              "1672824300",
              "1672901400",
              "1672910700",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96171/photo/468bacb0534b07b2/320.jpg?1655175426",
        time: "115分",
      },
      {
        name: "劇場版　転生したらスライムだった件　紅蓮の絆編",
        schedules: [
          {
            type: "",
            date: [
              "1672737600",
              "1672794900",
              "1672824000",
              "1672881300",
              "1672910400",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/95737/photo/f44033f086bee050/320.jpg?1665104053",
        time: "108分",
      },
      {
        name: "仮面ライダーギーツ×リバイス MOVIE バトルロワイヤル",
        schedules: [
          {
            type: "",
            date: [
              "1672729800",
              "1672788300",
              "1672798800",
              "1672816200",
              "1672874700",
              "1672885200",
              "1672902600",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96582/photo/100fa180737e2613/320.jpg?1667104485",
        time: "95分",
      },
      {
        name: "映画かいけつゾロリ　ラララ♪スターたんじょう",
        schedules: [{ type: "", date: ["1672788900", "1672875300"] }],
        image:
          "https://eiga.k-img.com/images/movie/97054/photo/2299b96285c8119e/320.jpg?1666051548",
        time: "70分",
      },
      {
        name: "劇場版　ソードアート・オンライン　プログレッシブ　冥（くら）き夕闇のスケルツォ",
        schedules: [
          { type: "", date: ["1672748700", "1672835100", "1672921500"] },
        ],
        image:
          "https://eiga.k-img.com/images/movie/96043/photo/9370a00674c2ac89/320.jpg?1656739449",
        time: "100分",
      },
      {
        name: "近江商人、走る！",
        schedules: [
          {
            type: "",
            date: [
              "1672748400",
              "1672798200",
              "1672834800",
              "1672884600",
              "1672921200",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/97804/photo/092912f9ef804454/320.jpg?1661842369",
        time: "114分",
      },
      {
        name: "劇場版　うたの☆プリンスさまっ♪　マジLOVEスターリッシュツアーズ",
        schedules: [
          {
            type: "",
            date: [
              "1672720200",
              "1672731300",
              "1672742100",
              "1672749300",
              "1672788600",
              "1672806600",
              "1672817700",
              "1672828500",
              "1672835700",
              "1672875000",
              "1672893000",
              "1672904100",
              "1672914900",
              "1672922100",
            ],
          },
        ],
        image:
          "https://eiga.k-img.com/images/movie/94796/photo/9367dc0efd1b62ab/320.jpg?1656637354",
        time: "65分",
      },
    ],
  },
];
